eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/emlib/inc/em_csen.h
/*******************************************************************************
 *******************************   STRUCTS   ***********************************
 ******************************************************************************/

/** CSEN initialization structure, common for all measurement modes. */
typedef struct {
  /** Requests system charge pump high accuracy mode. */
  bool                          cpAccuracyHi;

  /** Disables external kelvin connection and senses capacitor locally. */
  bool                          localSense;

  /** Keeps the converter warm allowing continuous conversions. */
  bool                          keepWarm;

  /** Converter warm-up time is warmUpCount + 3 converter clock cycles. */
  uint8_t                       warmUpCount;

  /** Period counter reload value. */
  uint8_t                       pcReload;

  /** Period counter pre-scaler. */
  CSEN_PCPrescale_TypeDef       pcPrescale;

  /** Peripheral reflex system trigger selection. */
  CSEN_PRSSel_TypeDef           prsSel;

  /** CSEN input to APORT channel mapping. */
  CSEN_InputSel_TypeDef         input0To7;   /** CSEN input select 0-7. */
  CSEN_InputSel_TypeDef         input8To15;  /** CSEN input select 8-15. */
  CSEN_InputSel_TypeDef         input16To23; /** CSEN input select 6-23. */
  CSEN_InputSel_TypeDef         input24To31; /** CSEN input select 24-31. */
  CSEN_InputSel_TypeDef         input32To39; /** CSEN input select 32-39. */
  CSEN_InputSel_TypeDef         input40To47; /** CSEN input select 40-47. */
  CSEN_InputSel_TypeDef         input48To55; /** CSEN input select 48-55. */
  CSEN_InputSel_TypeDef         input56To63; /** CSEN input select 56-63. */
} CSEN_Init_TypeDef;

/** CSEN default initialization. */
#define CSEN_INIT_DEFAULT                                             \
  {                                                                   \
    false,                      /* Charge pump low accuracy mode. */  \
    false,                      /* Use external kelvin connection. */ \
    false,                      /* Disable keep warm. */              \
    0,                          /* 0+3 cycle warm-up time. */         \
    0,                          /* Period counter reload. */          \
    csenPCPrescaleDiv1,         /* Period counter prescale. */        \
    csenPRSSELCh0,              /* PRS channel 0. */                  \
    csenInputSelAPORT1CH0TO7,   /* input0To7   -> aport1ch0to7 */     \
    csenInputSelAPORT1CH8TO15,  /* input8To15  -> aport1ch8to15 */    \
    csenInputSelAPORT1CH16TO23, /* input16To23 -> aport1ch16to23 */   \
    csenInputSelAPORT1CH24TO31, /* input24To31 -> aport1ch24to31 */   \
    csenInputSelAPORT3CH0TO7,   /* input32To39 -> aport3ch0to7 */     \
    csenInputSelAPORT3CH8TO15,  /* input40To47 -> aport3ch8to15 */    \
    csenInputSelAPORT3CH16TO23, /* input48To55 -> aport3ch16to23 */   \
    csenInputSelAPORT3CH24TO31, /* input56To63 -> aport3ch24to31 */   \
  }

/** Measurement mode initialization structure. */
typedef struct {
  /** Selects the conversion sample mode. */
  CSEN_SampleMode_TypeDef       sampleMode;

  /** Selects the conversion trigger source. */
  CSEN_TrigSel_TypeDef          trigSel;

  /** Enables DMA operation. */
  bool                          enableDma;

  /** Disables dividing the accumulated result. */
  bool                          sumOnly;

  /** Selects the number of samples to accumulate per conversion. */
  CSEN_AccMode_TypeDef          accMode;

  /** Selects the Exponential Moving Average sample weighting. */
  CSEN_EMASample_TypeDef        emaSample;

  /** Enables the comparator and selects the comparison type. */
  CSEN_CmpMode_TypeDef          cmpMode;

  /** Comparator threshold value. Meaning depends on @p cmpMode. */
  uint16_t                      cmpThr;

  /** Selects an APORT channel for a single conversion. */
  CSEN_SingleSel_TypeDef        singleSel;

  /**
   * Mask selects inputs 0 to 31. Effect depends on @p sampleMode. If sample
   * mode is bonded, then mask selects inputs to short together. If sample
   * mode is scan, then mask selects which inputs will be scanned. If sample
   * mode is single and auto-ground is on (@p autoGnd is true), mask selects
   * which pins are grounded.
   */
  uint32_t                      inputMask0;

  /** Mask selects inputs 32 to 63. See @p inputMask0 for more information. */
  uint32_t                      inputMask1;

  /** Ground inactive inputs during a conversion. */
  bool                          autoGnd;

  /** Selects the converter type. */
  CSEN_ConvSel_TypeDef          convSel;

  /** Selects the Successive Approximation (SAR) converter resolution. */
  CSEN_SARRes_TypeDef           sarRes;

  /** Selects the Delta Modulation (DM) converter resolution. */
  CSEN_DMRes_TypeDef            dmRes;

  /** Sets the number of DM iterations (comparisons) per cycle. Only applies
   *  to the Delta Modulation converter. */
  uint8_t                       dmIterPerCycle;

  /** Sets number of DM converter cycles. Only applies to the
   *  Delta Modulation converter. */
  uint8_t                       dmCycles;

  /** Sets the DM converter initial delta value. Only applies to the
   *  Delta Modulation converter. */
  uint8_t                       dmDelta;

  /** Disables DM automatic delta size reduction per cycle. Only applies to the
   *  Delta Modulation converter. */
  bool                          dmFixedDelta;

  /** Selects the reset phase timing. Most measurements should use the default
   *  value. See reference manual for details on when to adjust. */
  CSEN_ResetPhaseSel_TypeDef    resetPhase;

  /** Selects the output drive strength.  Most measurements should use the
  *  default value. See reference manual for details on when to adjust. */
  CSEN_DriveSel_TypeDef         driveSel;

  /** Selects the converter gain. */
  CSEN_GainSel_TypeDef          gainSel;
} CSEN_InitMode_TypeDef;

/** CSEN default mode initialization. */
#define CSEN_INITMODE_DEFAULT                                          \
  {                                                                    \
    csenSampleModeSingle,       /* Sample one input and stop. */       \
    csenTrigSelStart,           /* Use start bit to trigger. */        \
    false,                      /* Disable DMA. */                     \
    false,                      /* Average the accumulated result. */  \
    csenAccMode1,               /* Accumulate 1 sample. */             \
    csenEMASampleW1,            /* Disable the EMA. */                 \
    csenCmpModeDisabled,        /* Disable the comparator. */          \
    0,                          /* Comparator threshold not used. */   \
    csenSingleSelDefault,       /* Disconnect the single input. */     \
    0,                          /* Disable inputs 0 to 31. */          \
    0,                          /* Disable inputs 32 to 63. */         \
    false,                      /* Do not ground inactive inputs. */   \
    csenConvSelSAR,             /* Use the SAR converter. */           \
    csenSARRes10,               /* Set SAR resolution to 10 bits. */   \
    csenDMRes10,                /* Set DM resolution to 10 bits. */    \
    0,                          /* Set DM conv/cycle to default. */    \
    0,                          /* Set DM cycles to default. */        \
    0,                          /* Set DM initial delta to default. */ \
    false,                      /* Use DM auto delta reduction. */     \
    csenResetPhaseSel0,         /* Use shortest reset phase time. */   \
    csenDriveSelFull,           /* Use full output current. */         \
    csenGainSel8X,              /* Use highest converter gain. */      \
  }

